content = '''<p>一个故事，不同讲法。</p><p>我少时学《木兰辞》时，多赞美木兰代父从军，是为<b>孝顺</b>；保家卫国，是为<b>精忠</b>。
</p><p>美国人当年拍《花木兰》动画片，却重在男女平等，重在女性自立；最妙的情节，便是让木兰的同僚化妆成后宫宫女，解救天子。
这是一个很好的冷幽默。</p><p>但我别有一点想法。</p><p>《木兰辞》有许多可研究处。比如，里面隐约透出府兵制色彩；
比如，当时的行军路线与速度；比如，日常民俗——理红妆，贴花黄，磨刀霍霍向猪羊。</p><p>但我最爱的，却是其中一点：
<b>刚健洒脱，少年气象</b>。</p><p class="ztext-empty-paragraph"><br/></p><p class="ztext-empty-paragraph">
<br/></p><hr/><p class="ztext-empty-paragraph"><br/></p><p class="ztext-empty-paragraph"><br/></p><p>以前写过，
中国有一个时代，男性官员都不敢纳妾：那就是北朝时期。:4..21600235472316513059095857_.480480_480:4..21600235472316513059095857
_.:;8;39;:.3.200039;39;48039;39;48039;;;;480480_480:4..21600235472316513059095857_.:4..21600235472316513059095857_.
:1..297861483327790778990_.1080581_1080:1..297861483327790778990_.:;8;39;:.3.200039;39;108039;39;58139;;;;1080581_1080:1..
297861483327790778990_.:1..297861483327790778990_.'''
import re 
article = re.sub('\n','',content).replace(' ','')
article = re.sub('</p>','\n',article)
print(article)
article = re.sub('[a-z\d\<>/="--";:._]','',article)
article = re.sub('[\n]{2,}','\n',article) ##如果有空格的话这里的\n\n\n就不是连续的了，所以是用\n替换不了的
print()
print(article)
# article = re.split('\n',article)
# print(article)
# list = [i for i in article if i!=' ']
# print(list)
# for i in list:
#     print(i) 
