content = '[ti&#58;晴天]&#10;[ar&#58;周杰伦]&#10;[al&#58;叶惠美]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;00]晴天&#32;&#45;&#32;周杰伦&#32;&#40;Jay&#32;Chou&#41;&#10;[00&#58;07&#46;34]词：周杰伦&#10;[00&#58;14&#46;69]曲：周杰伦&#10;[00&#58;22&#46;04]编曲：周杰伦&#10;[00&#58;29&#46;39]故事的小黄花&#10;[00&#58;32&#46;64]从出生那年就飘着&#10;[00&#58;36&#46;19]童年的荡秋千'
import re
lyric = re.sub('&#10;','\n',content)
# print(lyric) ### \d等价于[0-9] \w等价于[A-Za-z_] \s等价于[\f\n\t\r\v] \D等价于[^0-9]
lyric1 = re.sub('[a-z J]','',lyric) # [a-z] 表示该位置上的字符在a-z之间，即匹配成功; [^a-z] 表示该位置上的字符不在a-z之间，即匹配成功
print(lyric1)
lyric2 = re.sub('[\[\]\d\&\#\;]','',lyric1) #出现这种[\[]...]必会报错
print(lyric2)
print()
lyric3 = re.sub('[\n]{2,}','\n',lyric2)
print(lyric3)