list = ['a','b','c']
sep = '|'
print(sep.join(list)) # 这他妈VS Code有毛病吧

what = ('龙卷风-', '周杰伦')
print(''.join(what))

list = ['晴天周杰伦', '词：周杰伦', '曲：周杰伦', '编曲：周杰伦', '故事的小黄花', '从出生那年就飘着', '童年的荡秋千',
'随记忆一直晃到现在', '吹着前奏望着天空', '我想起花瓣试着掉落', '为你翘课的那一天', '花落的那一天', '教室的那一间', 
'我怎么看不见', '消失的下雨天', '我好想再淋一遍', '没想到失去的勇气我还留着', '好想再问一遍', '你会等待还是离开', 
'刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能在你身边', '等到放晴的那天也许我会比较好一点',
'从前从前有个人爱你很久', '但偏偏风渐渐把距离吹得好远', '好不容易又能再多爱一天', '但故事的最后你好像还是说了拜拜',
'为你翘课的那一天', '花落的那一天', '教室的那一间', '我怎么看不见', '消失的下雨天', '我好想再淋一遍', '没想到失去的勇气我还留着'
'好想再问一遍', '你会等待还是离开', '刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能在你身边', 
'等到放晴的那天也许我会比较好一点', '从前从前有个人爱你很久', '偏偏风渐渐把距离吹得好远', '好不容易又能再多爱一天', 
'但故事的最后你好像还是说了拜拜', '刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能够在你身边', 
'等到放晴那天也许我会比较好一点', '从前从前有个人爱你很久', '但偏偏雨渐渐把距离吹得好远', '好不容易又能再多爱一天', 
'但故事的最后你好像还是说了拜']

# list = ['晴天周杰伦', '词：周杰伦', '曲：周杰伦', '编曲：周杰伦', '故事的小黄花', '从出生那年就飘着', '童年的荡秋千', 
# '随记忆一直晃到现在', '吹着前奏望着天空', '我想起花瓣试着掉落', '为你翘课的那一天', '花落的那一天', '教室的那一间', 
# '我怎么看不见', '消失的下雨天', '我好想再淋一遍', '没想到失去的勇气我还留着', '好想再问一遍', '你会等待还是离开', 
# '刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能在你身边', '等到放晴的那天也许我会比较好一点', 
# '从前从前有个人爱你很久', '但偏偏风渐渐把距离吹得好远', '好不容易又能再多爱一天', '但故事的最后你好像还是说了拜拜', 
# '为你翘课的那一天', '花落的那一天', '教室的那一间', '我怎么看不见', '消失的下雨天', '我好想再淋一遍', '没想到失去的勇气我还留着',
# '好想再问一遍', '你会等待还是离开', '刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能在你身边', 
# '等到放晴的那天也许我会比较好一点', '从前从前有个人爱你很久', '偏偏风渐渐把距离吹得好远', '好不容易又能再多爱一天', 
# '但故事的最后你好像还是说了拜拜', '刮风这天我试过握着你手', '但偏偏雨渐渐大到我看你不见', '还要多久我才能够在你身边', 
# '等到放晴那天也许我会比较好一点', '从前从前有个人爱你很久', '但偏偏雨渐渐把距离吹得好远', '好不容易又能再多爱一天', 
# '但故事的最后你好像还是说了拜']
# 这一行加不得，估计是太长了，软件反应不过来，我他妈注释一下都给我报错

print('\n'.join(list)) # 我透你妹的，垃圾软件错误百出，我真服了，换软件吧我真服了

from functools import reduce
lyric = reduce(lambda a,b:'{}\n{}'.format(a,b), list)
print(lyric)
