# 题目 输入一个奇数，然后判断最少几个 9 除于该数的结果为整数。
# 程序分析 999999 / 13 = 76923。
if __name__ == '__main__':
    zi = int(input('输入一个数字:'))
    n1 = 1
    c9 = 1
    m9 = 9
    sum = 9
    while n1 != 0:
        if sum % zi == 0: # 一直到sum可以整除zi才可以打破循环，不然都要执行slse语句
            n1 = 0
        else:
            m9 *= 10 # 9*10 90*10
            sum += m9 # 9+90 99+900 怎么说呢。看一下就明白了吧，就是构造几个9的
            c9 += 1
    print ('%d 个 9 可以被 %d 整除 : %d' % (c9,zi,sum))
    r = sum / zi
    print ('%d / %d = %d' % (sum,zi,r))

    # zi:11 n1:1 c9:1 m9:9 sum:9
    # m9:90 sum:99 c9:2
    # 99 % 11 == 0
    # print 2 11 99
    

